import bonchLogo from '../../images/bonchLogo.png';
import itmoLogo from '../../images/itmoLogo.png';

export default [
	{
		title: "Санкт-Петербургский национальный исследовательский университет информационных технологий, механики и оптики, Санкт-Петербург",
		faculty: "Академия ЛИМТУ",
		specialization: "Веб-технологии",
		degree: "Магистр",
		image: itmoLogo,
	},
	{
		title: "Санкт-Петербургский государственный университет телекоммуникаций им. проф. М.А. Бонч-Бруевича, Санкт-Петербург",
		faculty: "ИКСС",
		specialization: "Инфокоммуникационные системы и сети связи",
		degree: "Бакалавр",
		image: bonchLogo,
	},
	{
		title: "Санкт-Петербургский государственный университет телекоммуникаций им. проф. М.А. Бонч-Бруевича, Санкт-Петербург",
		faculty: "Институт военного образования",
		specialization: "Наземная спутниковая связь",
		degree: "Доп. высшее образование",
		image: bonchLogo,
	},
];